Hey there,

I'm running into this as well. If it helps in your repro, my current state (some values `...`'d):
```
$ tf state show 'module.ip_access_list.mongodbatlas_project_ip_access_list.main["1.2.3.4/20"]'
resource "mongodbatlas_project_ip_access_list" "main" {
    cidr_block = "1.2.3.4/20"
    comment    = "..."
    id         = "ZW50cnk=:MTAuOC4xNi4wLzIw-cHJvamVjdF9pZA==:NWQ1NjFjOGVjZjA5YTI3OGQyY2Y0YjM2"
    project_id = "..."

    timeouts {}
}
```
here's my module definition:
```
resource "mongodbatlas_project_ip_access_list" "main" {
  for_each = var.ip_access_data

  project_id = var.project_id
  cidr_block = each.key
  comment    = each.value
}
```
and here's what the `plan` gives:
```
  # module.ip_access_list.mongodbatlas_project_ip_access_list.main["1.2.3.4/20"] must be replaced
-/+ resource "mongodbatlas_project_ip_access_list" "main" {
      + aws_security_group = (known after apply) # forces replacement
      ~ id                 = "ZW50cnk=:MTAuOC4xNi4wLzIw-cHJvamVjdF9pZA==:NWQ1NjFjOGVjZjA5YTI3OGQyY2Y0YjM2" -> (known after apply)
      + ip_address         = (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      - timeouts {}
    }
```

FWIW I figured it wouldn't matter but I also tried explicitly setting `aws_security_group` and `ip_address` to `null` in my definition, but that didn't change anything.

Just wanted to drop this here if it helps, I'll probably also be doing a `tf state rm ...` and re-import today to get around this.